## Data Processing

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## Dataset

In [4]:
students_p = pd.read_csv('./data/StudentsPerformance.csv', delimiter = ',') 
students_p.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
 students_p.tail(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

Con el objetivo de facilitar el cálcuo de las gráficas y operaciones, se va a renombrar algunas de las columnas.

In [6]:
students_p = students_p.rename(columns = {'test preparation course ': 'test_preparation_course','race/ethnicity':'race',
                                          'parental level of education':'parental_level_of_education',
                       'test preparation course':'test_preparation_course','math score':'math_score',
                       'reading score':'reading_score', 'writing score':'writing_score'})

In [7]:
pd.DataFrame(list(students_p) ,columns = ['Columnas'])

                      Columnas
0                       gender
1                         race
2  parental_level_of_education
3                        lunch
4      test_preparation_course
5                   math_score
6                reading_score
7                writing_score

In [8]:
students_p.describe()

       math_score  reading_score  writing_score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [9]:
students_p.shape # filas y columnas

(1000, 8)

In [10]:
students_p.index

RangeIndex(start=0, stop=1000, step=1)

In [11]:
students_p.select_dtypes('object').nunique()

gender                         2
race                           5
parental_level_of_education    6
lunch                          2
test_preparation_course        2
dtype: int64

In [12]:
students_p.lunch.value_counts()

standard        645
free/reduced    355
Name: lunch, dtype: int64

In [13]:
students_p.test_preparation_course.value_counts()

none         642
completed    358
Name: test_preparation_course, dtype: int64

In [14]:
students_p = students_p.drop(['lunch', 'test_preparation_course'], axis=1)

In [15]:
pd.DataFrame(students_p.isna().sum(), columns = ['Valores NaN'])

                             Valores NaN
gender                                 0
race                                   0
parental_level_of_education            0
math_score                             0
reading_score                          0
writing_score                          0